; domain
(define (domain joint_visitall-assistance_domain)
(:requirements :typing :action-costs)

(:types
    place - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (connected ?x ?y -  place)
    (not-connected ?x ?y -  place)
    (at-prime ?x -  place)
    (visited ?x -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_create-connection
    :parameters (?a ?b - place)
    :precondition (and
        (supporter_turn)
        (not-connected ?a ?b)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (connected ?a ?b)
        (not (not-connected ?a ?b))
        (increase (total-cost) 1.0)
    )
)

(:action pri_move
    :parameters (?curpos ?nextpos - place)
    :precondition (and
        (prime_turn)
        (at-prime ?curpos)
        (connected ?curpos ?nextpos)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?nextpos)
        (visited ?nextpos)
        (not (at-prime ?curpos))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_visitall-assistance_problem_36)
(:domain joint_visitall-assistance_domain)
(:objects
    node1 node2 node3 node4 node5 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (connected node1 node2)
    (connected node2 node3)
    (connected node4 node5)
    (not-connected node1 node3)
    (not-connected node1 node4)
    (not-connected node1 node5)
    (not-connected node2 node1)
    (not-connected node2 node4)
    (not-connected node2 node5)
    (not-connected node3 node1)
    (not-connected node3 node2)
    (not-connected node3 node4)
    (not-connected node3 node5)
    (not-connected node4 node1)
    (not-connected node4 node2)
    (not-connected node4 node3)
    (not-connected node5 node1)
    (not-connected node5 node2)
    (not-connected node5 node3)
    (not-connected node5 node4)
    (at-prime node3)
    (visited node3)
)

(:goal
  (and
    (visited node1)
    (visited node2)
    (visited node4)
    (visited node5)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_create-connection node3 node1)
   deleted: (supporter_turn) (not-connected node3 node1)
   added: (prime_turn) (connected node3 node1)
   goals met: 0 of 4
2. (pri_noop)
   deleted: (prime_turn)
   added: (supporter_turn)
   goals met: 0 of 4
3. (sup_create-connection node2 node4)
   deleted: (supporter_turn) (not-connected node2 node4)
   added: (prime_turn) (connected node2 node4)
   goals met: 0 of 4
4. (pri_move node3 node1)
   deleted: (prime_turn) (at-prime node3)
   added: (supporter_turn) (at-prime node1) (visited node1)
   goals met: 1 of 4
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 1 of 4
6. (pri_move node1 node2)
   deleted: (prime_turn) (at-prime node1)
   added: (supporter_turn) (at-prime node2) (visited node2)
   goals met: 2 of 4
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 2 of 4
8. (pri_move node2 node4)
   deleted: (prime_turn) (at-prime node2)
   added: (supporter_turn) (at-prime node4) (visited node4)
   goals met: 3 of 4
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 3 of 4
10. (pri_move node4 node5)
   deleted: (prime_turn) (at-prime node4)
   added: (supporter_turn) (at-prime node5) (visited node5)
   goals met: 4 of 4
